Documents/Монтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Монтаж</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМонтажники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтажник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплатыДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплатыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановитьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поделиться</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПоделиться</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рассрочка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Монтаж/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
 
 ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
 
КонецПроцедуры

Процедура ПечатьАктДоставкаСборка(ТабДок, Ссылка) Экспорт
	
	Перем Инженер;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0";
	Спецификация = Ссылка.Спецификация;
	ДоговорСсылка = Документы.Спецификация.ПолучитьДоговор(Спецификация);
	
	Макет = Документы.Монтаж.ПолучитьМакет("АктДоставкаСборка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Дата,
	|	Монтаж.Спецификация,
	|	Монтаж.Номер,
	|	Монтаж.Подразделение,
	|	Монтаж.Экспедитор,
	|	Монтаж.Подразделение.Организация.ПолноеНаименование КАК ПолноеНаименование,
	|	Монтаж.Монтажник,
	|	Монтаж.Спецификация.Автор КАК Инженер,
	|	Договор.Контрагент КАК ФИОКлиента,
	|	Договор.Офис КАК АдресОфиса,
	|	Договор.Автор КАК Дизайнер,
	|	Договор.Дата КАК ДатаДоговора,
	|	Договор.Номер КАК НомерДоговора,
	|	Договор.СуммаДокумента КАК СуммаДокумента,
	|	Монтаж.Спецификация.Изделие КАК Изделие
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО Монтаж.Спецификация = Договор.Спецификация
	|ГДЕ
	|	Монтаж.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// ################
	// Доставка
	
	ОбластьДоставкаШапка = Макет.ПолучитьОбласть("ДоставкаШапка");
	ОбластьДоставкаСтрока = Макет.ПолучитьОбласть("ДоставкаСтрока");
	ОбластьДоставкаПодвал = Макет.ПолучитьОбласть("ДоставкаПодвал");
	
	ОбластьДоставкаШапка.Параметры.Заполнить(Выборка);
	ОбластьДоставкаШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
	
	ТабДок.Вывести(ОбластьДоставкаШапка);
	
	//ВыборкаИзделия = Выборка.Изделия.Выбрать();
	//Пока ВыборкаИзделия.Следующий() Цикл
	//	
	//	МассивРасчетИнженера = ЛексСервер.НайтиПодчиненныеДокументы(ВыборкаИзделия.РасчетСтоимостиИзделия, "Документ.РасчетИнженера", "ДокументОснование");	
	//	Если МассивРасчетИнженера.Количество() = 1 Тогда
	//		м2 = м2 + ЛексСервер.ПлощадьЛДСП(МассивРасчетИнженера[0]);
	//	Иначе
	//		м2 = 0;
	//	КонецЕсли;
		
		ОбластьДоставкаСтрока.Параметры.Заполнить(Выборка);
		//ОбластьДоставкаСтрока.Параметры.СуммаСоСкидкой = ВыборкаИзделия.Сумма - ВыборкаИзделия.Сумма * Выборка.СкидкаНаИзделия / 100;
		ТабДок.Вывести(ОбластьДоставкаСтрока);
		
	//	// будет выводится последний замерщик, дизайнер и инженер
	//	Замерщик = ВыборкаИзделия.Замерщик;
	//	Дизайнер = ВыборкаИзделия.Дизайнер;
	//	Если не ЗначениеЗаполнено(Инженер) Тогда
	//		МассивДокументов = ЛексСервер.НайтиПодчиненныеДокументы(ВыборкаИзделия.РасчетСтоимостиИзделия, "Документ.РасчетИнженера", "ДокументОснование");
	//		Если МассивДокументов.Количество() > 0 Тогда
	//			Инженер = МассивДокументов[0].Автор;
	//		КонецЕсли; 
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	ОбластьДоставкаПодвал.Параметры.Заполнить(Выборка);
	ОбластьДоставкаПодвал.Параметры.ДатаДоставки = Формат(Выборка.Дата, "ДЛФ=DD");
	ТабДок.Вывести(ОбластьДоставкаПодвал);
	
	// ################
	// Сборка
	
	ОбластьСборка = Макет.ПолучитьОбласть("Сборка");
	//ОбластьСборка.Параметры.м2 = м2;
	//ОбластьСборка.Параметры.Дизайнер = Дизайнер;
	//ОбластьСборка.Параметры.Замерщик = Замерщик;
	//ОбластьСборка.Параметры.Инженер = Инженер;
	//ВыборкаМонтажники = Выборка.Монтажники.Выбрать();
	//Если ВыборкаМонтажники.Следующий() Тогда
	//	ОбластьСборка.Параметры.Монтажник = ВыборкаМонтажники.Монтажник;
	//КонецЕсли;
	
	ОбластьСборка.Параметры.Заполнить(Выборка);	
	
	ТабДок.Вывести(ОбластьСборка);
	
КонецПроцедуры

Процедура ПечатьГрафикВывоза(ТабДок, Ссылка, НачалоПериода, КонецПериода, ВыбранноеПодразделение) Экспорт
	
	//Макет = Документы.Монтаж.ПолучитьМакет("ГрафикВывоза");
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	////|	Монтаж.Договор.ВремяДоставкиНачало КАК ВремяДоставкиНачало,
	////|	Монтаж.Договор.ВремяДоставкиКонец КАК ВремяДоставкиКонец,
	////|	Монтаж.Договор.АдресМонтажаПодъезд КАК Подъезд,
	////|	Монтаж.Договор.Этаж КАК Этаж,
	////|	Монтаж.Договор.АдресМонтажаУл КАК Улица,
	////|	Монтаж.Договор.Самовывоз КАК Самовывоз,
	////|	Монтаж.Договор.АдресМонтажаДом КАК Дом,
	////|	Монтаж.Договор.Клиент.ТелефонКонтактный КАК Телефон2,
	////|	Монтаж.Договор.Клиент.ТелефонСотовый КАК Телефон1,
	////|	Монтаж.Договор.АдресМонтажаКв КАК Квартира
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Монтаж.Дата КАК Дата,
	//|	Монтаж.Спецификация.Договор.Номер КАК НомерДоговора,
	//|	Монтаж.Спецификация.Договор.Контрагент.Телефон КАК Телефон,
	//|	Монтаж.Спецификация.АдресМонтажа КАК АдресМонтажа,
	//|	Монтаж.Спецификация.Доставка КАК Доставка,
	//|	Монтаж.Спецификация.Изделие КАК Изделие,
	//|	Монтаж.Спецификация.ДатаДоставки КАК ДатаДоставки
	//|ИЗ
	//|	Документ.Монтаж КАК Монтаж
	//|ГДЕ
	//|	Монтаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И Монтаж.Проведен
	//|	И Монтаж.Подразделение = &Подразделение
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата";
	////|	ВремяДоставкиНачало";
	//
	//Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	//Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	//Запрос.Параметры.Вставить("Подразделение", ВыбранноеПодразделение);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//Шапка.Параметры.ПериодСтр = ПредставлениеПериода(НачалоПериода, КонецПериода);
	//Строка = Макет.ПолучитьОбласть("Строка");
	//ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	//
	//ТабДок.Очистить();
	//ТабДок.Вывести(Шапка);
	//
	//НомерСтроки = 5;
	//НачалоТекДата = 5;
	//ТекДата = '0001.01.01';
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
	//		ТекДата = НачалоДня(Выборка.Дата) ;
	//	КонецЕсли;
	//	
	//	НомерСтроки = 1 + НомерСтроки;
	//	
	//	Если НачалоДня(ТекДата) <> НачалоДня(Выборка.Дата) Тогда
	//		
	//		ТабДок.Вывести(ПустаяСтрока);
	//		ТабДок.Вывести(ПустаяСтрока);
	//		НомерСтроки = 2 + НомерСтроки;
	//		
	//		Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
	//		Область.Объединить();
	//		ТекДата = НачалоДня(Выборка.Дата);
	//		НачалоТекДата = НомерСтроки - 1;
	//		
	//	КонецЕсли;
	//	
	//	//СтрокаИзделия = "";
	//	//ВыборкаИзделия = Выборка.Изделия.Выбрать();
	//	//Пока ВыборкаИзделия.Следующий() Цикл
	//	//	СтрокаИзделия = "" + СтрокаИзделия+" "+ВыборкаИзделия.Изделие.ДобавочныйСимволПоказаВСписке;
	//	//КонецЦикла;
	//	
	//	Строка.Параметры.Заполнить(Выборка);
	//	//Строка.Параметры.Изделия = СтрокаИзделия;
	//	Строка.Параметры.Дата = Формат((Выборка.Дата), "ДФ = дд.ММ")+" "+Формат((Выборка.Дата), "ДФ = дддд");
	//	//Строка.Параметры.ДатаВремяДоставки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1:00-%2:00", Выборка.ВремяДоставкиНачало, Выборка.ВремяДоставкиКонец);
	//	
	//	ТабДок.Вывести(Строка);
	//	
	//КонецЦикла;
	//
	//ТабДок.Вывести(ПустаяСтрока);
	//ТабДок.Вывести(ПустаяСтрока);
	//НомерСтроки = 2 + НомерСтроки;
	//
	//Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	//Область.Объединить();
	
КонецПроцедуры

Процедура ПечатьГрафикМонтажа(ТабДок, Ссылка, НачалоПериода, КонецПериода, Подразделение) Экспорт
	
	Макет = Документы.Монтаж.ПолучитьМакет("ГрафикМонтажа");
	Запрос = Новый Запрос;
	Запрос.Текст =
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.Клиент.ТелефонСотовый КАК Телефон1,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.АдресМонтажаКодДвери КАК Домофон,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.АдресМонтажаПодъезд КАК Подъезд,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.Этаж КАК Этаж,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.ВремяДоставкиНачало КАК ВремяДоставкиНачало,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.ВремяДоставкиКонец КАК ВремяДоставкиКонец,
	//|	ГрафикМонтажаИзделия.Ссылка.Договор.Самовывоз КАК Самовывоз,
	//|	ГрафикМонтажаИзделия.Ссылка.Комментарий
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Монтажник КАК Монтажник,
	|	Монтаж.Ссылка КАК СсылкаНаМонтаж,
	|	Монтаж.Ссылка.Дата КАК ДатаДоставки,
	|	Монтаж.Дата КАК Дата,
	|	Монтаж.Ссылка.Спецификация.Договор.Номер КАК НомерДоговора,
	|	Монтаж.Ссылка.Спецификация.Договор.Контрагент.Телефон КАК Телефон1,
	|	Монтаж.Ссылка.Экспедитор КАК Экспедитор,
	|	Монтаж.Ссылка.Спецификация.Договор.Ссылка КАК СсылкаНаДоговор,
	|	Монтаж.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Монтаж.Спецификация.Доставка КАК Доставка,
	|	Монтаж.Спецификация.ДатаМонтажа КАК ДатаМонтажа
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|ГДЕ
	|	Монтаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Монтаж.Ссылка.Проведен
	|	И Монтаж.Ссылка.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	Запрос.Параметры.Вставить("Подразделение", Подразделение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ПериодСтр = ПредставлениеПериода(НачалоПериода, КонецПериода);
	Строка = Макет.ПолучитьОбласть("Строка");
	ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок.Очистить();
	ТабДок.Вывести(Шапка);
		
	НомерСтроки = 5;
	НачалоТекДата = 5;
	ТекДата = '0001.01.01';
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата = НачалоДня(Выборка.ДатаМонтажа) ;
		КонецЕсли;
		
		НомерСтроки = 1 + НомерСтроки;
		
		Если НачалоДня(ТекДата) <> НачалоДня(Выборка.ДатаМонтажа) Тогда
			
			ТабДок.Вывести(ПустаяСтрока);
			ТабДок.Вывести(ПустаяСтрока);
			НомерСтроки = 2 + НомерСтроки;
			
			Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
			Область.Объединить();
			ТекДата = НачалоДня(Выборка.ДатаМонтажа);
			НачалоТекДата = НомерСтроки - 1;
			
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		//Если Выборка.Самовывоз Тогда
		//	Строка.Параметры.Комментарий = "Самовывоз / " + Выборка.Комментарий;
		//КонецЕсли;
		
		Строка.Параметры.Дата = Формат((Выборка.ДатаМонтажа), "ДФ = дд.ММ")+" "+Формат((Выборка.ДатаМонтажа), "ДФ = дддд");
		//Строка.Параметры.ДатаВремяДоставки = Формат((Выборка.ДатаДоставки), "ДФ = дд.МММ")
		//+Символы.ПС+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1:00-%2:00", Выборка.ВремяДоставкиНачало, Выборка.ВремяДоставкиКонец);
		
		Строка.Параметры.Телефоны = Выборка.Телефон1;// + Символы.ПС + Выборка.Телефон2;
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
	ТабДок.Вывести(ПустаяСтрока);
	ТабДок.Вывести(ПустаяСтрока);
	НомерСтроки = 2 + НомерСтроки;
	
	Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	Область.Объединить();
	
КонецПроцедуры

Функция ПолучитьПоДоговору(ДоговорСсылка) Экспорт
	
	Результат = Документы.Монтаж.ПустаяСсылка();
	
	МассивМонтаж = ЛексСервер.НайтиПодчиненныеДокументы(ДоговорСсылка, "Документ.Монтаж", "Договор");
	Количество = МассивМонтаж.Количество();
	
	Если Количество = 0 Тогда
		Результат = Документы.Монтаж.ПустаяСсылка();
	ИначеЕсли Количество = 1 Тогда
		Результат = МассивМонтаж[0];
	ИначеЕсли Количество > 1 Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Ошибка! С %1 связано несколько Графиков монтажа. Сообщите администратору номер договора", ДоговорСсылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ДоговорСсылка);
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПоДоговору()
